<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Slack.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.Slack-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>filename</key>
				<string>%NAME%.exe</string>
                <key>url</key>
				<string>https://slack.com/ssb/download-win</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
