<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of GoldenCheetah.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.GoldenCheetah</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoldenCheetah</string>

<!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
	"dmg" for MAC OS X
	"exe" for WINDOWS
	"deb" for LINUX DEBIAN
-->

		<key>os</key>
		<string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>GoldenCheetah/GoldenCheetah</string>
          		<key>asset_regex</key>
          		<string>(GoldenCheetah_[^"]*.%os%)</string>
        	</dict>
        		<key>Processor</key>
        		<string>GitHubReleasesInfoProvider</string>
      	</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>filename</key>
                <string>%NAME%-%version%.%os%</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Applications</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/GoldenCheetah.app</string>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
