<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Mindjet MindManager for Mac OS X.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.MindManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mindjet MindManager</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.mindmanager.com/mm-mac-dmg</string>
		        <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11) AppleWebKit/601.1.39 (KHTML, like Gecko) Version/9.0 Safari/601.1.39</string>
                </dict>
                <key>prefetch_filename</key>
                <true/>
            </dict>
        </dict>
	<dict>
	    <key>Processor</key>
	    <string>CodeSignatureVerifier</string>
	    <key>Arguments</key>
	    <dict>
	        <key>input_path</key>
	        <string>%pathname%/*.app</string>
	        <key>requirement</key>
	        <string>identifier "com.mindjet.mindmanager.22" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ZF6ZZ779N5</string>
	    </dict>
	</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
